<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class ProductTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $product = new \App\Models\Product([
            'imagePath' => 'src/photo/image_test_1.jpg',
            'title' => 'Шолом',
            'description' => 'Захист голови лише тоді повноцінний, коли шолом доповнений захистом очей. Сонцезахисні окуляри носять хіба що щоб уберегти органи зору від ультрафіолету та відблисків. Але щоб організувати по-справжньому хороший балістичний захист, потрібні тактичні окуляри із кріпленням до шолома.',
            'price' => 1000
        ]);
        $product->save();

        $product = new \App\Models\Product([
            'imagePath' => 'src/photo/image_test_2.jpg',
            'title' => 'Пояс',
            'description' => 'Носіння пістолета відкрито, на поясі або під рукою в кобурі, як не крути, викликає побоювання. Навіть якщо ви – співробітник правоохоронних органів, спецслужб, у людних місцях цього краще не робити, щоб не викликати зайвих питань. Помістіть короткоствольне підсумок на пояс для пістолета, і воно буде приховано від сторонніх очей. ',
            'price' => 1200
        ]);
        $product->save();

        $product = new \App\Models\Product([
            'imagePath' => 'src/photo/image_test_3.jpg',
            'title' => 'Фоторамка',
            'description' => 'Фоторамка з підсвічуванням левітуюча додасть частинку магії і трохи чудес техніки в інтерєр житла. Пристрій відрізняється компактними габаритами і загадковим футуристичним дизайном. Корпус виконаний з міцного матеріалу, що робить цифрову фоторамку досить міцною. Гідна якість збірки, мається на увазі - тривалий термін експлуатації.',
            'price' => 1400
        ]);
        $product->save();

        $product = new \App\Models\Product([
            'imagePath' => 'src/photo/image_test_4.jpg',
            'title' => 'Чашка',
            'description' => 'Ранок починається з ритуалу, який дарує енергію та приємне відчуття впевненості у своїх силах. Кожен новий день вітається силою та елегантністю, коли в руці тримаєш щось особливе. Іноді все, що нам потрібно, щоб змінити настрій і відчути себе справжнім героєм, це деталь, яка привертає погляд і викликає хвилю захоплення, яка має незвичайну та привабливу форму ручки.',
            'price' => 400
        ]);
        $product->save();

        $product = new \App\Models\Product([
            'imagePath' => 'src/photo/image_test_5.jpg',
            'title' => 'Прослуховувач',
            'description' => 'Прослуховувати музичні треки та дивитися кіно в потоковому режимі з Інтернету, якщо у домашньому обладнанні RTV немає Bluetooth, неможливо. Доводиться купувати нові гаджети. А це фінансові витрати! Вирішення проблеми Пристрій 2 в 1 забезпечить приємний перегляд відео та відтворення музики онлайн.',
            'price' => 800
        ]);
        $product->save();

        $product = new \App\Models\Product([
            'imagePath' => 'src/photo/image_test_6.jpg',
            'title' => 'Набір бармена',
            'description' => 'Любите коктейлі та незвичайні напої? Приготуйте їх в будинку, використовуючи. У комплект входить 8 девайсів для різних завдань, від простого відкриття пляшок до відсіювання льоду або великих шматочків фруктів.Використовуючи барний набір з підставкою, легко приготувати шоти, смузі, коктейлі «Мохіто», «Секс на пляжі» і т. Д. ',
            'price' => 4000
        ]);
        $product->save();
    }
}
